-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Янв 31 2025 г., 01:17
-- Версия сервера: 8.0.30
-- Версия PHP: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `27.01`
--

-- --------------------------------------------------------

--
-- Структура таблицы `agent`
--

CREATE TABLE `agent` (
  `ID` int NOT NULL,
  `Title` varchar(150) DEFAULT NULL,
  `AgentTypeID` int DEFAULT NULL,
  `Address` varchar(300) DEFAULT NULL,
  `INN` varchar(12) DEFAULT NULL,
  `KPP` varchar(9) DEFAULT NULL,
  `DirectorName` varchar(100) DEFAULT NULL,
  `Phone` varchar(40) DEFAULT NULL,
  `Email` varchar(255) DEFAULT NULL,
  `Logo` varchar(100) DEFAULT NULL,
  `Priority` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `agent`
--

INSERT INTO `agent` (`ID`, `Title`, `AgentTypeID`, `Address`, `INN`, `KPP`, `DirectorName`, `Phone`, `Email`, `Logo`, `Priority`) VALUES
(1, 'БухФлотФинансСнаб', 1, '035823, Смоленская область, город Одинцово, проезд Будапештсткая, 61', '4591032477', '290155423', 'Ираклий Максимович Титова', '8-800-121-66-81', 'elvira07@sysoeva.org', '\\agents\\agent_93.png', 338),
(2, 'ЛифтТомскСофтЦентр', 2, '280811, Омская область, город Балашиха, пер. Сталина, 15', '3908099185', '747184361', 'Виноградоваа Вера Александровна', '(812) 267-19-59', 'izolda.vorontov@lytkina.ru', '\\agents\\agent_116.png', 76),
(3, 'Транс', 1, '508299, Кемеровская область, город Кашира, пер. Гагарина, 42', '9604275878', '951258069', 'Евсеева Болеслав Сергеевич', '+7 (922) 467-93-83', 'email: artem.fadeev@polykov.com', '\\agents\\agent_66.png', 38),
(4, 'CибОмскМорЦентр', 3, '371407, Рязанская область, город Шатура, пл. Чехова, 48', '3626169571', '300062579', 'Гавриил Сергеевич Игнатьев', '8-800-317-35-79', 'fedotov.platon@pavlov.ru', '\\agents\\agent_96.png', 68),
(5, 'ОрионТомскТех', 2, '738763, Курская область, город Егорьевск, спуск Чехова, 66', '9351493429', '583041591', 'Георгий Александрович Лукин', 'phone: +7 (922) 851-23-23', 'faina.tikonova@veselov.com', '\\agents\\agent_58.png', 73),
(6, 'КрепОрионСофтПром', 4, '351666, Ульяновская область, город Луховицы, въезд Косиора, 07', '3776671267', '642177246', 'Алина Борисовна Потаповаа', '(495) 931-29-26', 'viktoriy.belozerova@isaev.net', 'нет', 38),
(7, 'ПивРадиоВектор', 3, '330228, Ивановская область, город Ногинск, ул. Славы, 42', '7447864518', '211697866', 'Изабелла Борисовна Архиповаа', 'phone: (495) 445-61-43', 'nazarov.polina@voronova.ru', '\\agents\\agent_108.png', 245),
(8, 'БашкирИнфоЭлектро', 1, '584771, Брянская область, город Раменское, наб. Славы, 53', '9037040523', '803529530', 'Дорофеева Зинаида Борисовна', '8-800-232-56-37', 'lebedeva.larisa@lavrentev.net', '\\agents\\agent_97.png', 289),
(9, 'Компания CибМоторКазань', 3, '887741, Тульская область, город Пушкино, пр. Чехова, 77', '6221520857', '758155852', 'Тетерина Георгий Сергеевич', '(495) 713-51-83', 'email: tamara22@pavlova.com', '\\agents\\agent_100.png', 136),
(10, 'Компания Газ', 3, '310403, Кировская область, город Солнечногорск, пл. Балканская, 76', '2262431140', '247369527', 'Давид Андреевич Фадеев', '(812) 823-93-42', 'email: alina56@zdanov.com', '\\agents\\agent_59.png', 445),
(11, 'СантехБашкир', 1, '180288, Тверская область, город Одинцово, ул. Бухарестская, 37', '4159215346', '639267493', 'Виктор Иванович Молчанов', '8-800-582-39-19', 'email: nikodim81@kiseleva.com', '\\agents\\agent_38.png', 369),
(12, 'ОрионГлав', 2, '729639, Магаданская область, город Талдом, въезд Будапештсткая, 98', '9032455179', '763045792', 'Тимофеева Григорий Андреевич', '(35222) 96-19-26', 'sermakova@sarova.net', '\\agents\\agent_45.png', 482),
(13, 'Мобайл', 5, '606703, Амурская область, город Чехов, пл. Будапештсткая, 91', '7803888520', '885703265', 'Екатерина Сергеевна Бобылёва', '8-800-511-43-61', 'email: dsiryev@dementeva.com', '\\agents\\agent_46.png', 464),
(14, 'Компания ТомскХоз', 3, '861543, Томская область, город Истра, бульвар Славы, 42', '8430391035', '961540858', 'Лазарева Аркадий Сергеевич', '(495) 893-71-17', 'email: nelli11@gureva.ru', '\\agents\\agent_54.png', 464),
(15, 'ЛенХозРем', 2, '946112, Волгоградская область, город Шаховская, пл. Сталина, 98', '4318970454', '389962934', 'Носов Михаил Андреевич', '(35222) 73-44-19', 'email: tdrozdov@ersova.ru', '\\agents\\agent_78.png', 3),
(16, 'Строй', 3, '426305, Калининградская область, город Чехов, пл. Ломоносова, 00', '7687851800', '470221602', 'Люся Владимировна Фёдороваа', 'phone: +7 (922) 233-27-68', 'wsamsonov@martynov.ru', '\\agents\\agent_76.png', 258),
(17, 'ЭлектроТранс', 5, '434616, Калининградская область, город Павловский Посад, пл. Ладыгина, 83', '6019144874', '450629885', 'Сава Александрович Титова', '(495) 688-28-59', 'boleslav.zukova@nikiforova.com', '\\agents\\agent_30.png', 129),
(18, 'Флот', 4, '505562, Тюменская область, город Наро-Фоминск, пр. Косиора, 11', '1112170258', '382584255', 'Василий Андреевич Ковалёв', 'phone: 8-800-538-41-77', 'gerasim.makarov@kornilov.ru', 'не указано', 473),
(19, 'ОмскЛифтРадио', 4, '146093, Белгородская область, город Можайск, пл. Ломоносова, 94', '8325114917', '356835763', 'Горбунов Назар Сергеевич', '(495) 452-58-94', 'email: kanisimov@nikolaev.ru', '\\agents\\agent_92.png', 373),
(20, 'ВостокНефть', 3, '171297, Оренбургская область, город Зарайск, проезд Сталина, 17', '3532367439', '788413794', 'Данила Александрович Кириллов', '+7 (922) 596-14-53', 'stanislav.zykov@volkova.net', '\\agents\\agent_120.png', 49),
(21, 'СервисХмельМонтаж', 4, '928260, Нижегородская область, город Балашиха, пл. Косиора, 44', '3459886235', '356196105', 'Анжелика Дмитриевна Горбунова', 'phone: (35222) 39-28-95', 'galina31@melnikov.ru', '\\agents\\agent_31.png', 124),
(22, 'АсбоцементЛифтРеч-H', 2, '599158, Ростовская область, город Озёры, ул. Космонавтов, 05', '6567878928', '560960507', 'Кондратьева Таисия Андреевна', '(495) 284-69-37', 'vladlena58@seliverstova.ru', '\\agents\\agent_44.png', 407),
(23, 'БухМоторТомск', 5, '936264, Ростовская область, город Ногинск, проезд Славы, 52', '5630128011', '571438707', 'Игорь Львович Щукина', '(812) 132-93-75', 'dmitrii05@zukov.ru', '\\agents\\agent_95.png', 65),
(24, 'Глав', 4, '077760, Ленинградская область, город Сергиев Посад, спуск Славы, 05', '6433380154', '715096638', 'Герман Иванович Гусева', '(812) 524-87-16', 'albert57@burova.ru', 'отсутствует', 35),
(25, 'Тяж', 2, '395435, Мурманская область, город Красногорск, шоссе Косиора, 47', '3302080044', '733101773', 'Бронислав Владимирович Ефимов', '(812) 976-77-15', 'vladlen06@melnikov.net', '\\agents\\agent_106.png', 402),
(26, 'ТелекомГор', 5, '210024, Белгородская область, город Сергиев Посад, наб. Ломоносова, 43', '3748947224', '766431901', 'Ксения Андреевна Михайлова', '8-800-752-71-45', 'email: gorskov.larisa@kalinin.com', '\\agents\\agent_37.png', 255),
(27, 'ОрионХмельCиб', 5, '266126, Ленинградская область, город Сергиев Посад, шоссе Чехова, 31', '9895514594', '587685742', 'Воробьёва Родион Максимович', '(35222) 85-24-18', 'pstepanova@siryev.com', '\\agents\\agent_105.png', 173),
(28, 'РадиоСевер', 5, '491360, Московская область, город Одинцово, въезд Ленина, 19', '5889206249', '372789083', 'Карпов Иосиф Максимович', '(495) 374-21-79', 'email: maiy.belov@rogov.ru', '\\agents\\agent_62.png', 431),
(29, 'CибСервисСевер', 3, '711370, Курская область, город Истра, пр. Будапештсткая, 89', '1719781819', '742676221', 'Чернов Геннадий Алексеевич', 'phone: +7 (922) 248-79-98', 'email: faina02@muraveva.com', '\\agents\\agent_74.png', 385),
(30, 'СофтРосБух', 4, '747695, Амурская область, город Сергиев Посад, въезд Бухарестская, 46', '8321561226', '807803984', 'Белова Полина Владимировна', 'phone: +7 (922) 947-11-99', 'email: ivanova.antonin@rodionov.ru', '\\agents\\agent_63.png', 69),
(31, 'Компания СервисТелеМотор', 3, '625988, Вологодская область, город Озёры, пр. Гоголя, 18', '3248454160', '138472695', 'Фролова Эдуард Борисович', 'phone: (35222) 13-15-63', 'veronika.egorov@bespalova.com', '\\agents\\agent_41.png', 81),
(32, 'КрепФлот', 5, '357783, Рязанская область, город Павловский Посад, наб. Домодедовская, 44', '2795067090', '967021779', 'Злата Романовна Корнилова', '8-800-753-27-68', 'danila.birykov@stepanov.ru', '\\agents\\agent_90.png', 349),
(33, 'ГаражФорсаж', 5, '294596, Мурманская область, город Шаховская, пр. Домодедовская, 88', '2816939574', '754741128', 'Клавдия Фёдоровна Кудряшова', 'phone: (495) 277-77-59', 'lydmila.belyeva@karpov.ru', '\\agents\\agent_47.png', 335),
(34, 'ГлавРечФлот', 1, '116028, Челябинская область, город Балашиха, шоссе Космонавтов, 69', '5299346323', '214239563', 'Шубина Валерия Евгеньевна', 'phone: 8-800-933-48-75', 'email: emysnikov@kiselev.net', '\\agents\\agent_85.png', 283),
(35, 'МикроБашкирГор', 4, '437208, Астраханская область, город Озёры, спуск Славы, 45', '5774378274', '352728364', 'Нонна Владимировна Горбунова', 'phone: (35222) 41-81-98', 'ybragina@odintov.org', '\\agents\\agent_86.png', 427),
(36, 'ХозЮпитер', 5, '038182, Курганская область, город Москва, спуск Космонавтов, 16', '6667635058', '380592865', 'Максимоваа Вера Фёдоровна', 'phone: (495) 178-61-32', 'email: jisakova@nazarova.com', '\\agents\\agent_53.png', 375),
(37, 'Дизайн', 6, '243999, Орловская область, город Можайск, пер. Домодедовская, 77', '9646693050', '201876935', 'Мельниковаа Федосья Борисовна', 'phone: +7 (922) 349-67-96', 'viktoriy73@kalinina.org', '\\agents\\agent_71.png', 330),
(38, 'ЛифтАлмазТех', 5, '925700, Нижегородская область, город Зарайск, шоссе Гоголя, 35', '3950510936', '240396350', 'Воронова Альберт Александрович', '(495) 834-12-97', 'donat.gerasimov@rogova.ru', '\\agents\\agent_77.png', 497),
(39, 'Вод', 4, '964386, Оренбургская область, город Чехов, пл. Косиора, 80', '1296063939', '447430051', 'Зоя Романовна Селезнёва', '(495) 811-36-55', 'email: savva86@zaiteva.ru', '\\agents\\agent_68.png', 359),
(40, 'CибГаз', 6, '365674, Архангельская область, город Серебряные Пруды, пр. Ленина, 29', '6483417250', '455013058', 'Вячеслав Романович Третьякова', '8-800-567-79-81', 'email: inna.sarova@panfilov.ru', '\\agents\\agent_42.png', 488),
(41, 'МеталСервисМор', 2, '293265, Иркутская область, город Клин, пр. Славы, 12', '6922817841', '580142825', 'Коновалова Кирилл Львович', '8-800-427-61-43', 'email: xdanilov@titov.ru', '\\agents\\agent_23.png', 475),
(42, 'МоторБашкирИнфоЭкспедиция', 2, '352034, Сахалинская область, город Домодедово, пр. Балканская, 97', '6542240791', '928029129', 'Тимофеева Регина Львовна', '(35222) 86-94-61', 'egorov.zanna@maslova.ru', '\\agents\\agent_88.png', 68),
(43, 'Пив', 2, '306012, Ростовская область, город Талдом, пл. Сталина, 01', '3936600214', '873471159', 'Макар Романович Савельев', 'phone: (812) 465-97-96', 'email: klavdiy50@nazarov.com', '\\agents\\agent_118.png', 198),
(44, 'Компания КазМеталКазань', 3, '532703, Пензенская область, город Чехов, наб. Чехова, 81', '4598939812', '303467543', 'Валерий Владимирович Хохлова', '(495) 683-76-57', 'mmoiseev@teterin.ru', '\\agents\\agent_69.png', 252),
(45, 'Компания Орион', 3, '661101, Оренбургская область, город Волоколамск, въезд Чехова, 16', '8698706801', '251899316', 'Елисееваа Эмилия Андреевна', '+7 (922) 916-34-31', 'msorokina@andreeva.ru', '\\agents\\agent_70.png', 227),
(46, 'ИнфоАлмазГлав', 4, '937201, Самарская область, город Воскресенск, въезд Космонавтов, 10', '8990745795', '517528851', 'Вишняков Гордей Владимирович', 'phone: +7 (922) 627-96-25', 'email: valentin23@sitnikov.net', '\\agents\\agent_112.png', 133),
(47, 'ТяжРадиоУралПроф', 5, '521087, Орловская область, город Егорьевск, шоссе Ладыгина, 14', '5688533246', '401535045', 'София Алексеевна Мухина', 'phone: +7 (922) 635-97-19', 'liliy62@grisina.ru', '\\agents\\agent_27.png', 278),
(48, 'РемМетиз', 3, '837800, Псковская область, город Солнечногорск, ул. Сталина, 67', '2129059967', '287016575', 'Жанна Евгеньевна Гришинаа', 'phone: (495) 698-56-86', 'mdavydov@blokin.org', '\\agents\\agent_111.png', 296),
(49, 'Гараж', 1, '585758, Самарская область, город Красногорск, бульвар Балканская, 13', '2638464552', '746822723', 'Панфилов Константин Максимович', '8-800-297-69-48', 'antonin51@korolev.com', 'не указано', 107),
(50, 'Компания МикроГлавУралЭкспедиция', 3, '225511, Новосибирская область, город Можайск, наб. Ладыгина, 82', '5555957575', '680301577', 'Зайцева Лада Дмитриевна', '(495) 484-42-65', 'nonna23@nesterova.ru', '\\agents\\agent_109.png', 387),
(51, 'БашкирРечТомск', 2, '136886, Амурская область, город Видное, въезд Космонавтов, 39', '7027724917', '823811460', 'Назарова Вера Андреевна', 'phone: +7 (922) 437-38-91', 'aleksandra77@karpov.com', '\\agents\\agent_39.png', 84),
(52, 'Орион', 2, '049104, Новгородская область, город Павловский Посад, бульвар Ладыгина, 58', '7387259022', '875652541', 'Клим Сергеевич Аксёнова', '(35222) 77-98-59', 'email: donat05@sokolova.com', '\\agents\\agent_104.png', 412),
(53, 'МетизСтрой', 6, '254238, Нижегородская область, город Павловский Посад, проезд Балканская, 23', '4024742936', '295608432', 'Ева Борисовна Беспалова', '(35222) 77-46-44', 'kristina.pakomov@burova.ru', '\\agents\\agent_33.png', 374),
(54, 'ЦементКрепТех-М', 4, '263764, Свердловская область, город Раменское, пер. Косиора, 28', '5359981084', '680416300', 'Сергеев Владлен Александрович', '(812) 413-91-32', 'yna.evdokimov@gordeeva.ru', '\\agents\\agent_21.png', 189),
(55, 'РемВод', 5, '449723, Смоленская область, город Наро-Фоминск, пер. Ломоносова, 94', '3986603105', '811373078', 'Медведеваа Ярослава Фёдоровна', 'phone: (812) 766-11-88', 'komarov.elizaveta@agafonova.ru', '\\agents\\agent_65.png', 1),
(56, 'БашкирМотор', 5, '073468, Читинская область, город Шаховская, наб. Косиора, 99', '6032171116', '180861585', 'Денисов Владимир Андреевич', '(812) 176-77-77', 'email: kseniy80@rusakov.net', '\\agents\\agent_117.png', 91),
(57, 'Компания МоторТелекомЦемент-М', 3, '021293, Амурская область, город Наро-Фоминск, шоссе Славы, 40', '7326832482', '440199498', 'Иван Евгеньевич Белоусова', 'phone: (812) 131-84-24', 'larisa44@silin.org', '\\agents\\agent_57.png', 237),
(58, 'ЦементСантехФинансЛизинг', 5, '165429, Курганская область, город Озёры, въезд Балканская, 17', '6290983121', '136566390', 'Даниил Фёдорович Григорьева', '+7 (922) 877-12-28', 'anfisa07@semenova.com', '\\agents\\agent_101.png', 70),
(59, 'Компания ВодАлмазIT', 3, '302100, Нижегородская область, город Мытищи, пер. 1905 года, 63', '2345297765', '908449277', 'Гуляев Егор Евгеньевич', 'phone: 8-800-595-91-99', 'email: zakar37@nikolaeva.ru', '\\agents\\agent_50.png', 31),
(60, 'Компания БашкирСтрой', 3, '152450, Брянская область, город Серебряные Пруды, наб. 1905 года, 56', '1660486169', '253830866', 'Яна Дмитриевна Моисееваа', 'phone: (35222) 89-74-97', 'bgromov@tretykov.org', '\\agents\\agent_80.png', 92),
(61, 'ТелеРечДизайн', 5, '063695, Новгородская область, город Можайск, шоссе Гагарина, 39', '6369492130', '115604622', 'Виктория Романовна Королёваа', '(812) 731-79-52', 'email: kazakova.yroslava@silina.net', '\\agents\\agent_82.png', 226),
(62, 'ГазГлавПивЛизинг', 5, '899084, Амурская область, город Талдом, спуск Балканская, 34', '5309136217', '170258253', 'Злата Сергеевна Архипова', 'phone: (495) 744-37-11', 'sysoeva.evgenii@kolesnikova.ru', '\\agents\\agent_91.png', 52),
(63, 'Софт', 5, '453714, Смоленская область, город Одинцово, спуск Косиора, 84', '3889910123', '952047511', 'Петухова Прохор Фёдорович', '(35222) 15-35-92', 'email: jterentev@ersov.com', '\\agents\\agent_61.png', 292),
(64, 'Инфо', 5, '100469, Рязанская область, город Ногинск, шоссе Гагарина, 57', '6549468639', '718386757', 'Баранова Виктор Романович', '(35222) 28-33-28', 'arsenii.mikailova@prokorov.com', '\\agents\\agent_28.png', 304),
(65, 'ЭлектроШум', 5, '975616, Вологодская область, город Клин, пер. Косиора, 57', '3124748557', '525403940', 'Игнатьеваа Флорентина Фёдоровна', '(35222) 28-59-34', 'nataly89@kulakov.ru', '\\agents\\agent_103.png', 109),
(66, 'РыбВостокCибСнаб', 4, '990758, Челябинская область, город Серпухов, въезд Космонавтов, 57', '2412503891', '711642010', 'Степанова Фаина Львовна', '8-800-486-84-47', 'email: filipp93@polykov.ru', '\\agents\\agent_94.png', 496),
(67, 'СервисПивВектор', 2, '669558, Омская область, город Шаховская, шоссе Гагарина, 55', '4098988911', '952390693', 'Олег Евгеньевич Журавлёв', '(812) 564-46-65', 'wersov@molcanova.com', '\\agents\\agent_87.png', 267),
(68, 'Бух', 2, '481744, Амурская область, город Щёлково, пл. Сталина, 48', '2320989197', '359282667', 'Тарасов Болеслав Александрович', 'phone: (35222) 99-92-42', 'valentina.bolsakova@aksenova.ru', '\\agents\\agent_43.png', 327),
(69, 'МеталТекстильЛифтТрест', 6, '786287, Свердловская область, город Волоколамск, пер. Будапештсткая, 72', '2971553297', '821859486', 'Одинцов Назар Борисович', 'phone: 8-800-736-36-73', 'muravev.trofim@sazonov.net', '\\agents\\agent_25.png', 425),
(70, 'ВостокЛен', 1, '546530, Тульская область, город Видное, наб. Гагарина, 63', '1697025997', '931878289', 'Лыткинаа Люся Дмитриевна', '(495) 971-71-24', 'dmitrii90@zaitev.ru', '\\agents\\agent_114.png', 246),
(71, 'АлмазАсбоцементБухКомплекс', 2, '794964, Мурманская область, город Озёры, ул. 1905 года, 56', '8996890877', '349709983', 'Зыков Никита Александрович', '(812) 752-53-41', 'email: akoseleva@dementeva.ru', '\\agents\\agent_119.png', 39),
(72, 'ТверьМонтажОмск', 2, '761751, Амурская область, город Балашиха, шоссе Гоголя, 02', '2421347164', '157370604', 'Матвей Романович Большакова', '(35222) 92-87-52', 'dteterina@selezneva.ru', '\\agents\\agent_67.png', 272),
(73, 'ТверьХозМорСбыт', 6, '252101, Ростовская область, город Дорохово, пер. Ленина, 85', '6681338084', '460530907', 'Аким Львович Субботина', '(35222) 72-93-38', 'email: marina58@koroleva.com', '\\agents\\agent_56.png', 207),
(74, 'МорТехТелекомСнаб', 5, '239247, Архангельская область, город Лотошино, бульвар Ломоносова, 28', '4354676693', '631235170', 'Беспалова Ева Романовна', '8-800-359-95-29', 'garri.rybakov@ermakova.com', '\\agents\\agent_98.png', 149),
(75, 'Лифт', 3, '479565, Курганская область, город Клин, пл. Ленина, 54', '6169713039', '848972934', 'Вера Евгеньевна Денисоваа', 'phone: (812) 887-59-97', 'zinaida01@bespalova.ru', '\\agents\\agent_40.png', 92),
(76, 'МясХмельФлот', 6, '252826, Костромская область, город Солнечногорск, проезд Ленина, 75', '3019787650', '974897634', 'Гавриил Львович Зуева', 'phone: 8-800-548-11-53', 'anna48@alekseev.ru', '\\agents\\agent_72.png', 372),
(77, 'Компания МобайлЮпитерМобайл', 3, '697880, Тюменская область, город Егорьевск, проезд Домодедовская, 82', '3824054933', '715845254', 'Рожкова Аркадий Владимирович', '(812) 941-35-96', 'klara.gavrilov@nosova.com', '\\agents\\agent_75.png', 31),
(78, 'Компания Инж', 3, '475644, Ивановская область, город Луховицы, въезд Будапештсткая, 43', '6730622378', '201657751', 'Чернова Инесса Сергеевна', '8-800-765-67-46', 'email: osilova@muravev.ru', '\\agents\\agent_99.png', 179),
(79, 'АсбоцементТехАвто', 1, '304975, Пензенская область, город Солнечногорск, шоссе Балканская, 76', '7626076463', '579234124', 'Сидорова Любовь Ивановна', '(495) 676-81-98', 'matveev.yliy@kiseleva.ru', '\\agents\\agent_49.png', 247),
(80, 'Cиб', 3, '194134, Омская область, город Волоколамск, пер. Косиора, 79', '7892739766', '524021828', 'Беспалова Мирослав Владимирович', '(812) 373-27-64', 'email: anfisa50@krykova.org', '\\agents\\agent_83.png', 174),
(81, 'СервисТомск', 1, '194903, Амурская область, город Ногинск, ул. Бухарестская, 45', '8538379073', '761935124', 'Егор Сергеевич Филиппов', '(35222) 66-31-65', 'email: mukin.lev@komarov.ru', '\\agents\\agent_79.png', 475),
(82, 'ТверьМетизУралСнос', 3, '880551, Ленинградская область, город Красногорск, ул. Гоголя, 61', '1076095397', '947828491', 'Зоя Андреевна Соболева', '+7 (922) 497-22-19', 'rlazareva@novikov.ru', '\\agents\\agent_48.png', 165),
(83, 'Электро', 5, '966815, Новгородская область, город Одинцово, пр. Космонавтов, 19', '7896029866', '786038848', 'Шарапова Елена Дмитриевна', '(812) 264-41-75', 'likacev.makar@antonov.ru', '\\agents\\agent_32.png', 366),
(84, 'Компания Алмаз', 3, '016215, Воронежская область, город Зарайск, ул. Косиора, 48', '6698862694', '662876919', 'Фоминаа Лариса Романовна', '+7 (922) 167-89-39', 'email: akalinina@zaitev.ru', '\\agents\\agent_60.png', 259),
(85, 'ПивЛенТверь', 4, '783238, Тюменская область, город Серебряные Пруды, проезд 1905 года, 67', '9476119404', '365311390', 'Костин Савва Романович', '(812) 653-19-26', 'dnikitina@antonova.ru', '\\agents\\agent_110.png', 190),
(86, 'МетизБухРем', 5, '318328, Кемеровская область, город Павловский Посад, спуск 1905 года, 92', '1449531554', '124871353', 'Нонна Фёдоровна Федотова', '+7 (922) 852-73-43', 'email: koselev.anfisa@selezneva.ru', 'нет', 112),
(87, 'ITСтройАлмаз', 5, '361730, Костромская область, город Волоколамск, шоссе Славы, 36', '7689065648', '456612755', 'Алексеева Валериан Андреевич', '(35222) 46-33-91', 'fokin.eduard@samoilov.com', 'не указано', 159),
(88, 'МонтажОрионУрал', 6, '027573, Тамбовская область, город Коломна, ул. Ленина, 20', '1692286718', '181380912', 'Давыдоваа Нина Евгеньевна', '8-800-916-27-93', 'email: pzaitev@blokin.org', '\\agents\\agent_35.png', 50),
(89, 'ВодГор', 5, '265653, Калужская область, город Ступино, шоссе Гоголя, 89', '4463113470', '899603778', 'Фаина Фёдоровна Филиппова', 'phone: (35222) 61-58-74', 'tvetkova.robert@sorokin.com', '\\agents\\agent_64.png', 72),
(90, 'ВостокКазРыб', 1, '059565, Оренбургская область, город Истра, шоссе Домодедовская, 27', '7411284960', '176779733', 'Самсонов Родион Романович', 'phone: +7 (922) 263-93-51', 'flukin@misin.org', '\\agents\\agent_51.png', 361),
(91, 'ЛифтРыб', 3, '076703, Саратовская область, город Одинцово, ул. Косиора, 01', '3997121859', '970823018', 'Субботин Анатолий Евгеньевич', '+7 (922) 298-45-48', 'maksim86@fokina.ru', 'отсутствует', 445),
(92, 'УралСтройХмель', 4, '462632, Костромская область, город Шаховская, шоссе Сталина, 92', '8773558039', '402502867', 'Август Борисович Красильникова', 'phone: (812) 986-94-47', 'aleksandr95@kolobova.ru', '\\agents\\agent_52.png', 372),
(93, 'ГаражРосВекторПроф', 6, '828207, Тверская область, город Щёлково, наб. Ленина, 70', '1092776106', '164232266', 'Абрам Фёдорович Дроздов', '8-800-595-65-86', 'adrian61@guseva.ru', '\\agents\\agent_81.png', 189),
(94, 'Каз', 6, '432454, Ленинградская область, город Луховицы, пр. Косиора, 88', '1036132639', '918316432', 'Святослав Андреевич Моисеева', '(495) 829-15-77', 'jsafonov@molcanov.com', '\\agents\\agent_115.png', 291),
(95, 'КрепМетал', 3, '103296, Иркутская область, город Солнечногорск, пл. 1905 года, 59', '1689100612', '671073273', 'Андрей Сергеевич Лобанов', '+7 (922) 537-88-64', 'nika.kalasnikov@maslova.ru', 'не указано', 471),
(96, 'Компания ЖелДорТверьМонтаж', 3, '152424, Рязанская область, город Сергиев Посад, ул. 1905 года, 27', '3325722996', '665766347', 'Нестор Максимович Гуляев', '(495) 168-53-94', 'burova.zlata@zueva.ru', '\\agents\\agent_24.png', 2),
(97, 'ОрионСофтВодСнос', 4, '577227, Калужская область, город Павловский Посад, наб. Чехова, 35', '1522348613', '977738715', 'Мухина Ян Фёдорович', '8-800-187-56-96', 'isukanov@sobolev.com', '\\agents\\agent_36.png', 361),
(98, 'БухМясМоторПром', 5, '677498, Костромская область, город Зарайск, спуск Славы, 59', '7377410338', '592041317', 'Нина Дмитриевна Черноваа', '(35222) 73-81-81', 'varvara49@savin.ru', 'нет', 158),
(99, 'ГлавБашкирМоторБанк', 2, '258285, Ульяновская область, город Ступино, пл. Ладыгина, 83', '9101293748', '531950230', 'Стефан Алексеевич Андреев', '(495) 134-27-72', 'xaksenova@kazakov.ru', 'нет', 98),
(100, 'Рем', 2, '373761, Псковская область, город Наро-Фоминск, наб. Гагарина, 03', '9006569852', '152177100', 'Альбина Александровна Романова', '(812) 111-67-11', 'rafail96@sukin.ru', '\\agents\\agent_55.png', 88);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `agent`
--
ALTER TABLE `agent`
  ADD PRIMARY KEY (`ID`),
  ADD KEY `AgentTypeID` (`AgentTypeID`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `agent`
--
ALTER TABLE `agent`
  MODIFY `ID` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `agent`
--
ALTER TABLE `agent`
  ADD CONSTRAINT `agent_ibfk_1` FOREIGN KEY (`AgentTypeID`) REFERENCES `agenttype` (`ID`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
